CSI API ETABS v1

# cDesignConcreteSlabStartSlabDesign Method

---

Starts the concrete slab design.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int StartSlabDesign()

    Function StartSlabDesign As Integer

    Dim instance As cDesignConcreteSlab
    Dim returnValue As Integer

    returnValue = instance.StartSlabDesign()

    int StartSlabDesign()

    abstract StartSlabDesign : unit -> int

#### Return Value

Type: Int32
Returns zero if the concrete slab design is successfully started; otherwise it
returns a nonzero value.

Remarks

This function designs slab strips, individual finite elements, and checks for
punching shear, if concrete slabs are present. The function will fail if
analysis results are not available.

See Also

#### Reference

cDesignConcreteSlab Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com